new_idea/logs/debug_5_original.log
INFO 12-12 09:20:28 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f5adedfb1a0>, seed=0, num_prompts=5, dataset_name='custom', no_stream=False, dataset_path='/local/huzaifa/workspace/vLLM/vllm-serverless-optimization/new_idea/traces/modified_conversation_trace_5.jsonl', no_oversample=False, custom_output_len=256, custom_skip_chat_template=True, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', endpoint_type=None, base_url=None, host='127.0.0.1', port=8500, endpoint='/v1/completions', header=None, max_concurrency=None, model='/local/huzaifa/workspace/vLLM/vllm-serverless-optimization/models/llama3-3b', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='/local/huzaifa/workspace/vLLM/vllm-serverless-optimization/new_idea/logs/bench_results_llama3-3b_5.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='95,99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, use_timestamp=True, custom_scheduler=False, model_to_port_map_file=None, sleep_level=2, check_every=0.1, wakeup_timeout=10)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Sending request for model None
Sending request for model None
Sending request for model None
[...]

                             Output tokens per second
  900 +---------------------------------------------------------------------+
      |                                                                     |
  800 |********                                                             |
      |        ***********                                                  |
  700 |                   **                                                |
      |                     **                                              |
  600 |                       **                                            |
      |                         **                                          |
  500 |                           **                                        |
      |                             **                                      |
      |                               **                                    |
  400 |                                 ***                                 |
      |                                    ****                             |
  300 |                                        ***                          |
      |                                           ****                      |
  200 |                                               ****                  |
      |                                                   ****              |
  100 |                                                       ******        |
      |                                                             ******  |
    0 +---------------------------------------------------------------------+
      0       0.5       1      1.5       2       2.5       3      3.5       4

                         Concurrent requests per second
  5 +-----------------------------------------------------------------------+
    |  ****                                                                 |
    |      *****                                                            |
    |           ****                                                        |
  4 |               *****                                                   |
    |                    ****                                               |
    |                        *****                                          |
    |                             ****                                      |
  3 |                                 ****                                  |
    |                                     **                                |
    |                                       ***                             |
  2 |                                          **                           |
    |                                            ***                        |
    |                                               ***                     |
    |                                                  **                   |
  1 |                                                    ****               |
    |                                                        ****           |
    |                                                            *****      |
    |                                                                 ****  |
  0 +-----------------------------------------------------------------------+
    0       0.5       1       1.5       2       2.5       3       3.5       4
============ Serving Benchmark Result ============
Successful requests:                     5         
Benchmark duration (s):                  3.52      
Total input tokens:                      30376     
Total generated tokens:                  2103      
Request throughput (req/s):              1.42      
Output token throughput (tok/s):         597.65    
Peak output token throughput (tok/s):    804.00    
Peak concurrent requests:                5.00      
Total Token throughput (tok/s):          9230.16   
---------------Time to First Token----------------
Mean TTFT (ms):                          55.77     
Median TTFT (ms):                        60.67     
P95 TTFT (ms):                           66.09     
P99 TTFT (ms):                           66.31     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          4.51      
Median TPOT (ms):                        4.66      
P95 TPOT (ms):                           4.73      
P99 TPOT (ms):                           4.74      
---------------Inter-token Latency----------------
Mean ITL (ms):                           4.57      
Median ITL (ms):                         4.68      
P95 ITL (ms):                            4.94      
P99 ITL (ms):                            5.04      
==================================================